<template>
  <div class="col-12 q-mt-lg">
    <div class="row justify-center">
      <div class="col-10 ruls-content q-mb-lg">
        <div class="row justify-center">
          <div class="col">
            <div class="row justify-center">
              <div class="col-11 text q-mt-md q-mb-md">
                <div class="title q-mb-md">
                  Футбол: команда и запасные игроки.
                </div>
                Футбол: команда и запасные игроки. В состав команды входят 11
                человек: 1 вратарь и 10 полевых игроков, которые в свою очередь
                подразделяются на защитников, полузащитников и нападающих. В
                играх на очки и в кубковых играх на протяжении одного матча
                может быть произведена замена 2 игроков из каждой команды.
                Продолжительность матча мужских и молодежных команд (с 16 до 18
                лет) составляет 90 мин. Матч состоит из двух таймов по 45 мин.
                После перерыва, минимальная продолжительность которого 5 мин,
                команды меняются воротами.Полевые игроки могут касаться мяча
                любой частью тела, кроме рук. За игру рукой команде назначается
                штрафной удар или 11-метровый удар, который выполняет игрок
                команды соперника.Если мяч пересекает лицевую линию или боковую
                линию, то он считается вышедшим из игры. Если мяч пересек
                боковую линию, то он считается вышедшим из игры. Если мяч
                пересек боковую линию после удара игроком одной команды, то
                производится вбрасывание мяча игроком команды соперника с места
                пересечения боковой линии. Вбрасывающий стоит лицом к полю,
                ногами на боковой линии или за ее пределами и вбрасывает мяч
                обеими руками из-за головы. Если от удара соперника мяч
                пересекает лицевую линию, то судья назначает удар от ворот, при
                котором удар по мячу производится из вратарской площадки. Если
                мяч после удара игроком пересекает лицевую линию его команды, то
                судья назначает угловой удар. Гол считается забитым, если мяч
                пересек линию ворот между боковыми стойками и под перекладиной
                ворот. Согласно правилам, существует два вида ударов: штрафной
                удар и свободный удар. Штрафной удар назначается за нечестную
                игру или за игру рукой. Свободный удар назначается за
                непреднамеренное нарушение правил или за неправильные игровые
                действия. При выполнении свободного удара гол будет засчитан в
                том случае, если мяча коснулся еще один игрок, кроме подающего.

                <div class="title q-mt-md q-mb-md">
                  Футбол: «Положение вне игры».
                </div>
                Правило «вне игры» запрещает игрокам атакующей команды
                находиться к линии ворот соперника ближе, чем защитники
                соперника. Если в момент передачи мяча между игроком и линией
                ворот соперника находится менее двух игроков команды соперника,
                включая вратаря, то такой игрок будет в положении «вне игры».
                При положении «вне игры» назначается свободный удар. Положение
                «вне игры» не фиксируется при аналогичной ситуации на своей
                половине поля, при выполнении ударов от ворот, угловых ударов,
                при вбрасывании из-за боковой линии и при спорном вбрасывании.
              </div>
            </div>
            <div class="row justify-center">
              <div class="col-6 col-md-2 q-mb-md">
                <div class="row full-height items-center justify-around">
                  <div class="left"></div>
                  <div class="round"></div>
                  <div class="right"></div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style scoped>
.ruls-content {
  background: rgba(255, 255, 255, 0.04);
}
.title {
  font-size: 20px;
}
.round {
  width: 6px;
  height: 6px;
  border-radius: 50%;
  background: #a10b45;
}
.left {
  background-image: url("../../public/index/left.png");
  background-repeat: no-repeat;
  background-size: 100% 100%;
  width: 34px;
  height: 30px;
}
.right {
  background-image: url("../../public/index/right.png");
  background-repeat: no-repeat;
  background-size: 100% 100%;
  width: 34px;
  height: 30px;
}
</style>
