<template>
  <div class="col-12 q-mb-xl">
    <div class="row justify-center">
      <div class="col-10">
        <div class="row justify-center">
          <div class="logo col-4">
            <div class="row justify-center items-center logo-div">
              <div class="logo"></div>
            </div>
          </div>
          <div class="info col-8">
            <div class="title">{{ obj.title }}</div>
            <div class="text">{{ obj.text }}</div>
            <div class="acumbName">{{ obj.acumbName }}</div>
            <div class="text2">{{ obj.text2 }}</div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  
  data() {
    return {
      obj: {
        title: "Фили́пе Коути́ньо Корре́я",
        acumbName: "«Барселона»",
        text: `Фили́пе Коути́ньо Корре́я — бразильский футболист, выступающий на позиции  полузащитника клуба «Барселона» и сборной Бразилии. Третий и младший сын  Эсмеральды Коутиньо и архитектора Хосе Карлоса Коррейи, Коутиньо родился 12 июня 1992 года в Рио-де-Жанейро, весом 3,1 кг (6 фунтов 10 унций). Он вырос в северном районе Роча в Рио между старым городком и промышленными складами. В детстве он последовал за своими ста ршими братьями Криштиану  и Леандро на местное бетонное футбольное поле, где он впервые начал игратьв мини-футбол. В рамках ограниченного пространства, при наличии нужных навыков и способности к импровизации, маленький Коутиньо оттачивал свой природный талант. По настоянию его бабушки поступил в местную футбольную академию, позже его отец попросил тренеров молодежной команды «Васко да Гамы» о просмотре сына, после чего Коутиньо присоединился к молодёжке.`,
        text2: `В августе 2017 года испанская «Барселона» вела с «Ливерпулем» переговоры о приобретении Коутиньо, который запросил трансфер. Директор «Барселоны»Альберт Солер утверждал, что англичане отвергли три предложения и запросили за игрока 200 млн евро (183 млн фунтов стерлингов), на что руководство каталонского клуба не согласилось. 6 января 2018 года Коутиньо перешёл в «Барселону» за 106 млн фунтов стерлингов[14]. Эта сумма может возрасти до 142 млн за счёт бонусов. Контракт игрока рассчитан на пять с половиной лет, сумма отступных за него составила 400 млн евро.
В апреле 2009 года был вызван в состав Бразилии на Южной Америки до 17 лет. По ходу турнира сыграл 5 матчей, в которых забил 3 мяча. В 2011 году Коутиньо был вызван тренером Нэйем Франко на чемпионат мира до 20 лет, проходивший в Колумбии. Во второй встрече со сборной Австрии отличился, точно пробив с пенальти. В следующем поединке оформил дубль в ворота Панамы.
Свой первый матч в футболке «селесао» Коутиньо провёл 7 октября 2010 года, выйдя на поле в основном составе. Матч завершился со счётом 3:0 в пользу Бразилии, на момент этого поединка игроку было 18 лет. В 2011 году Коутиньо выступал за сборную Бразилии U-20 на чемпионате мира в Турции. В финале турнира бразильцы переиграли сверстников из `,
      },
    };
  },
};
</script>

<style scoped>
.logo-div {
  border-top: 1px solid rgba(255, 237, 76, 0.8);
  border-right: 2px solid rgba(255, 237, 76, 0.8);
  border-bottom: 15px solid rgba(255, 237, 76, 0.8);
  border-left: 15px solid rgba(255, 237, 76, 0.8);
}
.logo {
  background-image: url("../../public/index/image5.png");
  background-repeat: no-repeat;
  background-size: 100% 100%;
  width: 259px;
  height: 259px;
  padding-right: 8px;
}
.info {
  background: rgba(255, 255, 255, 0.06);
  height: 487px;
  overflow: auto;
  position: relative;
}
.title {
  font-size: 42px;
  color: #d8c622;
  font-family: "Arsenal";
  text-align: center;
  margin-bottom: 30px;
}
.acumbName {
  font-size: 22px;
  color: #d8c622;
  margin: 10px 0px;
}
</style>
